app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "name", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Concordo!"], ["name", "Levy"], ["post_id", 3], ["created_at", "2015-04-06 04:57:58.784553"], ["updated_at", "2015-04-06 04:57:58.784553"]]
---
<p>
	<strong>Posted <%= time_ago_in_words(comment.created_at) %></strong> <br />