app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 15).order('created_at DESC')

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find_by_id(params[:id])

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Bem-vindos!"], ["body", "ESTAMOS DE <strong>CARA NOVA</strong>"], ["created_at", "2015-04-06 03:03:46.457420"], ["updated_at", "2015-04-06 03:03:46.457420"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "OPA! Fugiat architecto reprehenderit autem."], ["updated_at", "2016-09-11 08:02:37.348059"], ["id", 98]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)